## 图空间

```bash
# 创建指定分片数量、副本数量和 VID 类型，并添加描述。
CREATE SPACE IF NOT EXISTS my_space (partition_num=15, replica_factor=1, vid_type=FIXED_STRING(30)) comment="测试图空间";
# 克隆图空间。
CREATE SPACE IF NOT EXISTS my_space_1 as my_space;
# 列出所有图空间
SHOW SPACES;
# 使用图空间
USE my_space;
# 描述
DESC SPACE my_space;
# 清空图空间中的点和边，但不会删除图空间本身以及其中的 Schema 信息。
CLEAR SPACE my_space;
# 删除
DROP SPACE
```

检查分片情况：

```bash
# 检查分片情况
SHOW HOSTS;
# 如果 Leader distribution 分布不均，需要重新分配
BALANCE LEADER;
```

## TAG 和 Edge TYPE

```bash
# 创建标签 Tag:player和team
CREATE TAG team(name string);
CREATE TAG player(name string, age int);
# 创建边类型
CREATE EDGE follow(degree int);
CREATE EDGE serve(start_year int, end_year int);
```

## 索引

```bash
# 为 name 属性创建索引 player_index_1。
CREATE TAG INDEX IF NOT EXISTS player_index_1 ON player(name(20));
# 重建索引确保能对已存在数据生效。
REBUILD TAG INDEX player_index_1;
# 查询已创建的索引： SHOW {TAG | EDGE} INDEXES;
SHOW TAG INDEXES;
# 展示索引创建的 nGQL 语句
SHOW CREATE TAG INDEX player_index_1;
# 删除索引
DROP TAG INDEX player_index_1;
```

## CRUD

* 插入

```bash
# 插入点数据
INSERT VERTEX player(name, age) VALUES "player100":("Tim Duncan", 42);
INSERT VERTEX player(name, age) VALUES "player101":("Tony Parker", 36);
INSERT VERTEX player(name, age) VALUES "player102":("LaMarcus Aldridge", 33);
INSERT VERTEX team(name) VALUES "team203":("Trail Blazers"), "team204":("Spurs");

# 插入边数据
INSERT EDGE follow(degree) VALUES "player101" -> "player100":(95);
INSERT EDGE follow(degree) VALUES "player101" -> "player102":(90);
INSERT EDGE follow(degree) VALUES "player102" -> "player100":(75);
INSERT EDGE serve(start_year, end_year) VALUES "player101" -> "team204":(1999, 2018),"player102" -> "team203":(2006,  2015);
```

* 查询

```bash
# 从 VID 为player101的球员开始，沿着边follow找到连接的球员。
GO FROM "player101" OVER follow YIELD id($$);
# 从 VID 为player101的球员开始，沿着边follow查找年龄大于或等于 35 岁的球员，并返回他们的姓名和年龄，同时重命名对应的列。
GO FROM "player101" OVER follow WHERE properties($$).age >= 35 \
	YIELD properties($$).name AS Teammate, properties($$).age AS Age;
# 从 VID 为player101的球员开始，沿着边follow查找连接的球员，然后检索这些球员的球队。为了合并这两个查询请求，可以使用管道符或临时变量。
GO FROM "player101" OVER follow YIELD dst(edge) AS id | \
	GO FROM $-.id OVER serve YIELD properties($$).name AS Team, \
	properties($^).name AS Player;
	
# 查询 VID 为player100的球员的属性。
FETCH PROP ON player "player100" YIELD properties(vertex);

# 使用 LOOKUP 语句检索点的属性。
LOOKUP ON player WHERE player.name == "Tony Parker" \
        YIELD properties(vertex).name AS name, properties(vertex).age AS age;
# 使用 MATCH 语句检索点的属性。
MATCH (v:player{name:"Tony Parker"}) RETURN v;
```

| 子句/符号 | 说明                               |
| --------- | ---------------------------------- |
| `YIELD`   | 指定该查询需要返回的值或结果。     |
| `$$`      | 表示边的终点。                     |
| `$^`      | 表示边的起点。                     |
| `$-`      | 表示管道符前面的查询输出的结果集。 |

* 修改

```bash
# 用UPDATE修改 VID 为player100的球员的name属性。
UPDATE VERTEX "player100" SET player.name = "Tim";
# 用UPDATE修改某条边的degree属性，
UPDATE EDGE "player101" -> "player100" OF follow SET degree = 96;
# 用UPSERT更新数据
UPSERT VERTEX "player111" SET player.name = "David", player.age = $^.player.age + 11 \
        WHEN $^.player.name == "David West" AND $^.player.age > 20 \
        YIELD $^.player.name AS Name, $^.player.age AS Age;
```

* 删除

```bash
# 删除点
DELETE VERTEX "player111", "team203";
# 删除边
DELETE EDGE follow "player101" -> "team204";
```
